//去掉134行while(1);的分號 
//75行加getch();將100行if(num<1||num>9)改成if(t<1||t>9) 
//在137行}後面加了; 
//137行刪掉while(1) 
//在137行}後面加了break;
// void tri(char ch)中的i改成x，j改成y
//143、144改成while (1);	return 0; 
//將112改成nin(t);
//將152行改成for (char y = 'a'; y <= x; y++)
#include<stdio.h>
#include<stdlib.h>
#include<conio.h>

void tri(char ch);
void nin(int num);

int main (void)
{
	int password=2024,n,a=0,t,num;
	char abc,con,ch;
	printf("*********************************************************\n");
	printf("*****              **********   ********         ********\n");
	printf("*****  ********************  *  ********  *******  ******\n");
	printf("*****  *******************  **  ********  ********  *****\n");
	printf("*****  ******************  ***  ********  *********  ****\n");
	printf("*****  ***********************  ********  **********  ***\n");
	printf("*****              ***********  ********            *****\n");
	printf("*****  ***********************  ********  ***************\n");
	printf("*****  ***********************  ********  **********  ***\n");
	printf("*****  ***********************  ********  *********  ****\n");
	printf("*****  ***********************  ********  ********  *****\n");
	printf("*****              *******          ****          *******\n");
	printf("*********************************************************\n");
	printf("*********************************************************\n");
	printf("*****              *********             ****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****  **********  *********             ****************\n");
	printf("*****  **********  ********************  *****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****  **********  ********************  *****************\n");
	printf("*****  **********  ********************  ****************\n");
	printf("*****              *********             ****************\n");
	printf("*********************************************************\n");
	
	
	
	while(a<3)
	{
		printf("請輸入 4 個數字的密碼:");
		scanf("%d",&n);
		if(n==password)
		{
			break;
		}
		else
		{
			a++;
			printf("密碼錯誤%d次\n",3-a);
		}
	}
	if(a==3)
	{
		printf("錯誤次數超過3次，程序退出\n");
		return 0;
	}
	
	do{
		system("cls");
		
		printf("*********************************************************\n");
		printf("******                   主選單                    ******\n");
		printf("*********************************************************\n");
		printf("*                    a. 畫出直角三角形                  *\n");
		printf("*                    b. 顯示乘法表                      *\n");
		printf("*                    c. 結束                            *\n");
		printf("*********************************************************\n");
		printf("\n");
		printf("輸入一個選項\n");
		scanf("%c",&abc);
		getch();
		 
		switch (abc)
		{
			case 'A':
			case 'a':
				{
					system("cls");
					printf("請輸入一個a~n的字元");
					scanf("%c",&ch);
					if(ch<'a'||ch>'n')
					{
						printf("輸入錯誤，請輸入a~n的字元\n");
					}
					else
						tri(ch);
					break;
				}
			case 'B':
			case 'b':
				{
					system("cls");
					printf("請輸入一個1~9的整數:\n");
					scanf("%d",&t);
					if(t<1||t>9)
					{
						printf("請輸入一個1~9的整數:");
						scanf("%d",&t);
					}
					else
						nin(t);

					break;
				
				}
			case 'C':
			case 'c':
				{
					system("cls");
					printf("Continue? (y/n)\n");
					scanf("%c",&con);
					if(con=='n'||con=='N')
						return 0;
					else if(con=='y'||con=='Y')
						break;
					else
					{
						printf("錯誤訊息，請重新輸入:\n");
						printf("Continue? (y/n)\n");
						scanf("%c",&con);
						getch();
						break; 
					}
				
				}
			default:
				printf("輸入錯誤，請重新輸入選項:");
				scanf("%c",&abc);
				break;
				
		}
	}while (1);	
	return 0;
 } 
 
 void tri(char ch)
 {
 	int x=1,y=1;
 	for (char x = 'a'; x <= ch; x++) 
	 {
    	for (char y = 'a'; y <= x; y++) 
		{
        	printf("%c ", y);
    	}
    printf("\n");
 	}
 	printf("按下任意鍵繼續\n");
 	getch();
 }

 void nin(int num)
 {
 	int i=1,j=1;
 	while(i<=num)
 	{
 		while(j<=num)	
 		{
 			printf("%d*%d=%2d",i,j,i*j);
 			j++;
		 }
		 printf("\n");
		 i++;
		 j=1;
	}
	printf("按下任意鍵繼續\n");
 	getch();
 }
 
 
 
 
 
 
 
 
